# Data Manipulation in Spark: SQL vs DataFrame Functions

This notebook provides a comprehensive comparison of data manipulation in Spark using SQL and built-in DataFrame functions. For each task, we’ll show both methods to perform the operation, so you can see how they compare in syntax and flexibility.

## Step 1: Initialize SparkSession

The first step is to create a SparkSession, which is the entry point for working with Spark SQL and DataFrames.

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import col, expr, avg, sum

# Initialize Spark Session
spark = SparkSession.builder.appName("SQL vs DataFrame Tutorial").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/11/02 14:37:42 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/11/02 14:37:42 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
24/11/02 14:37:42 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
24/11/02 14:37:42 WARN Utils: Service 'SparkUI' could not bind on port 4042. Attempting port 4043.
24/11/02 14:37:42 WARN Utils: Service 'SparkUI' could not bind on port 4043. Attempting port 4044.
24/11/02 14:37:42 WARN Utils: Service 'SparkUI' could not bind on port 4044. Attempting port 4045.

## Step 2: Create a Sample DataFrame

We'll create a sample DataFrame that we can use for various manipulation tasks throughout this tutorial.

In [2]:
data = [
    (1, "Alice", "Sales", 50000, 29),
    (2, "Bob", "Engineering", 60000, 35),
    (3, "Cathy", "Sales", 55000, 30),
    (4, "David", "Engineering", 65000, 40),
    (5, "Eva", "Marketing", 45000, 23)
]
columns = ["ID", "Name", "Department", "Salary", "Age"]

# Create DataFrame
df = spark.createDataFrame(data, columns)
df.show()

+---+-----+-----------+------+---+
| ID| Name| Department|Salary|Age|
+---+-----+-----------+------+---+
|  1|Alice|      Sales| 50000| 29|
|  2|  Bob|Engineering| 60000| 35|
|  3|Cathy|      Sales| 55000| 30|
|  4|David|Engineering| 65000| 40|
|  5|  Eva|  Marketing| 45000| 23|
+---+-----+-----------+------+---+

## Step 3: Selecting Specific Columns

Let's select the `Name` and `Salary` columns using both SQL and DataFrame syntax.

In [3]:
# Using SQL
df.createOrReplaceTempView("employees")
spark.sql("SELECT Name, Salary FROM employees").show()

+-----+------+
| Name|Salary|
+-----+------+
|Alice| 50000|
|  Bob| 60000|
|Cathy| 55000|
|David| 65000|
|  Eva| 45000|
+-----+------+

In [4]:
# Using DataFrame functions
df.select("Name", "Salary").show()

+-----+------+
| Name|Salary|
+-----+------+
|Alice| 50000|
|  Bob| 60000|
|Cathy| 55000|
|David| 65000|
|  Eva| 45000|
+-----+------+

## Step 4: Filtering Rows

Filter employees with a `Salary` greater than 50000 using both SQL and DataFrame syntax.

In [5]:
# Using SQL
spark.sql("SELECT * FROM employees WHERE Salary > 50000").show()

+---+-----+-----------+------+---+
| ID| Name| Department|Salary|Age|
+---+-----+-----------+------+---+
|  2|  Bob|Engineering| 60000| 35|
|  3|Cathy|      Sales| 55000| 30|
|  4|David|Engineering| 65000| 40|
+---+-----+-----------+------+---+

In [6]:
# Using DataFrame functions
df.filter(col("Salary") > 50000).show()

+---+-----+-----------+------+---+
| ID| Name| Department|Salary|Age|
+---+-----+-----------+------+---+
|  2|  Bob|Engineering| 60000| 35|
|  3|Cathy|      Sales| 55000| 30|
|  4|David|Engineering| 65000| 40|
+---+-----+-----------+------+---+

## Step 5: Aggregation and Grouping

Find the average salary by `Department` using both SQL and DataFrame syntax.

In [7]:
# Using SQL
spark.sql("SELECT Department, AVG(Salary) AS Avg_Salary FROM employees GROUP BY Department").show()

+-----------+----------+
| Department|Avg_Salary|
+-----------+----------+
|      Sales|   52500.0|
|Engineering|   62500.0|
|  Marketing|   45000.0|
+-----------+----------+

In [8]:
# Using DataFrame functions
df.groupBy("Department").agg(avg("Salary").alias("Avg_Salary")).show()

+-----------+----------+
| Department|Avg_Salary|
+-----------+----------+
|      Sales|   52500.0|
|Engineering|   62500.0|
|  Marketing|   45000.0|
+-----------+----------+

## Step 6: Sorting Data

Sort employees by `Salary` in descending order using both SQL and DataFrame syntax.

In [9]:
# Using SQL
spark.sql("SELECT * FROM employees ORDER BY Salary DESC").show()

+---+-----+-----------+------+---+
| ID| Name| Department|Salary|Age|
+---+-----+-----------+------+---+
|  4|David|Engineering| 65000| 40|
|  2|  Bob|Engineering| 60000| 35|
|  3|Cathy|      Sales| 55000| 30|
|  1|Alice|      Sales| 50000| 29|
|  5|  Eva|  Marketing| 45000| 23|
+---+-----+-----------+------+---+

In [10]:
# Using DataFrame functions
df.orderBy(col("Salary").desc()).show()

+---+-----+-----------+------+---+
| ID| Name| Department|Salary|Age|
+---+-----+-----------+------+---+
|  4|David|Engineering| 65000| 40|
|  2|  Bob|Engineering| 60000| 35|
|  3|Cathy|      Sales| 55000| 30|
|  1|Alice|      Sales| 50000| 29|
|  5|  Eva|  Marketing| 45000| 23|
+---+-----+-----------+------+---+

## Step 7: Adding a Calculated Column

Add a new column `Bonus` which is 10% of `Salary`, using both SQL and DataFrame syntax.

In [11]:
# Using SQL
spark.sql("SELECT *, Salary * 0.1 AS Bonus FROM employees").show()

+---+-----+-----------+------+---+------+
| ID| Name| Department|Salary|Age| Bonus|
+---+-----+-----------+------+---+------+
|  1|Alice|      Sales| 50000| 29|5000.0|
|  2|  Bob|Engineering| 60000| 35|6000.0|
|  3|Cathy|      Sales| 55000| 30|5500.0|
|  4|David|Engineering| 65000| 40|6500.0|
|  5|  Eva|  Marketing| 45000| 23|4500.0|
+---+-----+-----------+------+---+------+

In [12]:
# Using DataFrame functions
df.withColumn("Bonus", col("Salary") * 0.1).show()

+---+-----+-----------+------+---+------+
| ID| Name| Department|Salary|Age| Bonus|
+---+-----+-----------+------+---+------+
|  1|Alice|      Sales| 50000| 29|5000.0|
|  2|  Bob|Engineering| 60000| 35|6000.0|
|  3|Cathy|      Sales| 55000| 30|5500.0|
|  4|David|Engineering| 65000| 40|6500.0|
|  5|  Eva|  Marketing| 45000| 23|4500.0|
+---+-----+-----------+------+---+------+

## Step 8: Renaming Columns

Rename the `Age` column to `Employee_Age` using both SQL and DataFrame syntax.

In [13]:
# Using SQL
spark.sql("SELECT ID, Name, Department, Salary, Age AS Employee_Age FROM employees").show()

+---+-----+-----------+------+------------+
| ID| Name| Department|Salary|Employee_Age|
+---+-----+-----------+------+------------+
|  1|Alice|      Sales| 50000|          29|
|  2|  Bob|Engineering| 60000|          35|
|  3|Cathy|      Sales| 55000|          30|
|  4|David|Engineering| 65000|          40|
|  5|  Eva|  Marketing| 45000|          23|
+---+-----+-----------+------+------------+

In [14]:
# Using DataFrame functions
df.withColumnRenamed("Age", "Employee_Age").show()

+---+-----+-----------+------+------------+
| ID| Name| Department|Salary|Employee_Age|
+---+-----+-----------+------+------------+
|  1|Alice|      Sales| 50000|          29|
|  2|  Bob|Engineering| 60000|          35|
|  3|Cathy|      Sales| 55000|          30|
|  4|David|Engineering| 65000|          40|
|  5|  Eva|  Marketing| 45000|          23|
+---+-----+-----------+------+------------+

## TODO 1: Calculate Total Compensation

Add a new column `Total_Compensation`, which is the sum of `Salary` and `Bonus`. Try this using both SQL and DataFrame syntax.

### Solution

In [15]:
# Solution: Using SQL
spark.sql("SELECT *, Salary + (Salary * 0.1) AS Total_Compensation FROM employees").show()

+---+-----+-----------+------+---+------------------+
| ID| Name| Department|Salary|Age|Total_Compensation|
+---+-----+-----------+------+---+------------------+
|  1|Alice|      Sales| 50000| 29|           55000.0|
|  2|  Bob|Engineering| 60000| 35|           66000.0|
|  3|Cathy|      Sales| 55000| 30|           60500.0|
|  4|David|Engineering| 65000| 40|           71500.0|
|  5|  Eva|  Marketing| 45000| 23|           49500.0|
+---+-----+-----------+------+---+------------------+

In [16]:
# Solution: Using DataFrame functions
df.withColumn("Bonus", col("Salary") * 0.1) \
  .withColumn("Total_Compensation", col("Salary") + col("Bonus")) \
  .show()

+---+-----+-----------+------+---+------+------------------+
| ID| Name| Department|Salary|Age| Bonus|Total_Compensation|
+---+-----+-----------+------+---+------+------------------+
|  1|Alice|      Sales| 50000| 29|5000.0|           55000.0|
|  2|  Bob|Engineering| 60000| 35|6000.0|           66000.0|
|  3|Cathy|      Sales| 55000| 30|5500.0|           60500.0|
|  4|David|Engineering| 65000| 40|6500.0|           71500.0|
|  5|  Eva|  Marketing| 45000| 23|4500.0|           49500.0|
+---+-----+-----------+------+---+------+------------------+

## TODO 2: Filter and Sort by Department and Age

Filter for employees in the `Sales` department who are under 35, and then sort them by `Age` in ascending order. Try this using both SQL and DataFrame syntax.

### Solution

In [17]:
# Solution: Using SQL
spark.sql("SELECT * FROM employees WHERE Department = 'Sales' AND Age < 35 ORDER BY Age ASC").show()

+---+-----+----------+------+---+
| ID| Name|Department|Salary|Age|
+---+-----+----------+------+---+
|  1|Alice|     Sales| 50000| 29|
|  3|Cathy|     Sales| 55000| 30|
+---+-----+----------+------+---+

In [18]:
# Solution: Using DataFrame functions
df.filter((col("Department") == "Sales") & (col("Age") < 35)) \
  .orderBy(col("Age").asc()) \
  .show()

+---+-----+----------+------+---+
| ID| Name|Department|Salary|Age|
+---+-----+----------+------+---+
|  1|Alice|     Sales| 50000| 29|
|  3|Cathy|     Sales| 55000| 30|
+---+-----+----------+------+---+

## TODO 3: Group by Department and Calculate Total Salary

Group employees by `Department` and calculate the total salary per department. Try this using both SQL and DataFrame syntax.

### Solution

In [19]:
# Solution: Using SQL
spark.sql("SELECT Department, SUM(Salary) AS Total_Salary FROM employees GROUP BY Department").show()

+-----------+------------+
| Department|Total_Salary|
+-----------+------------+
|      Sales|      105000|
|Engineering|      125000|
|  Marketing|       45000|
+-----------+------------+

In [20]:
# Solution: Using DataFrame functions
df.groupBy("Department").agg(sum("Salary").alias("Total_Salary")).show()

+-----------+------------+
| Department|Total_Salary|
+-----------+------------+
|      Sales|      105000|
|Engineering|      125000|
|  Marketing|       45000|
+-----------+------------+

## SQL-Only vs. DataFrame-Only Operations

Here, we’ll explore the operations that can only be performed with SQL and those that can only be done with DataFrame functions.

### SQL-Only Operations
1. **Complex Joins with Multiple Conditions**: SQL is often simpler for multi-condition joins.
   ```sql
   SELECT a.Name, b.Department FROM employees a 
   JOIN departments b ON a.ID = b.ID AND a.Salary > b.Salary
   ```
2. **Window Functions**: SQL allows window functions with partitioning and ordering over subsets.
   ```sql
   SELECT Name, Salary, RANK() OVER(PARTITION BY Department ORDER BY Salary DESC) AS SalaryRank FROM employees
   ```
3. **Subqueries**: SQL supports nested queries, useful for filtering with complex conditions.
   ```sql
   SELECT * FROM employees WHERE Salary > (SELECT AVG(Salary) FROM employees)
   ```

### DataFrame-Only Operations
1. **Custom UDFs (User-Defined Functions)**: DataFrames allow custom Python functions to be applied to columns.
   ```python
   from pyspark.sql.functions import udf
   from pyspark.sql.types import IntegerType
   
   def add_bonus(salary):
       return salary + 1000
   
   add_bonus_udf = udf(add_bonus, IntegerType())
   df.withColumn("Adjusted_Salary", add_bonus_udf(df["Salary"])).show()
   ```
2. **Chaining Transformations**: DataFrame syntax is better for chaining multiple transformations.
   ```python
   df.withColumn("Bonus", col("Salary") * 0.1).filter(col("Age") > 30).groupBy("Department").count().show()
   ```
3. **Conditional Expressions**: Complex conditions can be handled with `when` and `otherwise` functions.
   ```python
   from pyspark.sql.functions import when
   df.withColumn("High_Salary", when(col("Salary") > 60000, "Yes").otherwise("No")).show()
   ```

## Conclusion

In this tutorial, we explored how to perform common data manipulation tasks in Spark using both SQL and DataFrame functions. We highlighted unique capabilities that each approach offers:
- SQL is powerful for complex queries involving joins, subqueries, and window functions.
- DataFrames are preferred for transformations involving custom Python functions (UDFs) and chained operations.

Choosing between SQL and DataFrame syntax in Spark often depends on the complexity of the operation, familiarity with SQL, and the need to integrate with Python-based transformations.

In [21]:
# Stop the Spark session
spark.stop()